renesas/rx-driver-package/source/r_dmaca_rx/r_dmaca_rx_vx.xx/r_dmaca_rx/src/targets/rx72t/r_dmaca_rx_target.c
    if (0x00 != (channel & DMACA_DMIS5_BIT_MASK))
    {
        /* If the pointer to function is not 'NULL' */
        if (((uint32_t)NULL != (uint32_t)g_pdmaci_handlers[DMACA_CH5]) &&
           /* If the pointer to function is not 'FIT_NO_FUNC' */
           ((uint32_t)FIT_NO_FUNC != (uint32_t)g_pdmaci_handlers[DMACA_CH5]))
        {
            /* Callback function handles for channel 5 */
            ((DMACI_Callback)g_pdmaci_handlers[DMACA_CH5])();
        }
        else
        {
            /* do something */
        }
    }

    if (0x00 != (channel & DMACA_DMIS6_BIT_MASK))
    {
        /* If the pointer to function is not 'NULL' */
        if (((uint32_t)NULL != (uint32_t)g_pdmaci_handlers[DMACA_CH6]) &&
           /* If the pointer to function is not 'FIT_NO_FUNC' */
           ((uint32_t)FIT_NO_FUNC != (uint32_t)g_pdmaci_handlers[DMACA_CH6]))
        {
            /* Callback function handles for channel 6 */
            ((DMACI_Callback)g_pdmaci_handlers[DMACA_CH6])();
        }
        else
        {
            /* do something */
        }
    }

    if (0x00 != (channel & DMACA_DMIS7_BIT_MASK))
    {
        /* If the pointer to function is not 'NULL' */
        if (((uint32_t)NULL != (uint32_t)g_pdmaci_handlers[DMACA_CH7]) &&
           /* If the pointer to function is not 'FIT_NO_FUNC' */
           ((uint32_t)FIT_NO_FUNC != (uint32_t)g_pdmaci_handlers[DMACA_CH7]))
        {
            /* Callback function handles for channel 7 */
            ((DMACI_Callback)g_pdmaci_handlers[DMACA_CH7])();
        }
        else
        {
            /* do something */
        }
    }

    return;
}
/**************************************************************************
* End of function r_dmaca_intdmac74i_isr
*************************************************************************/

/*******************************************************************************
* Function Name: r_dmaca_int_disable
* Description  : Disables DMACmI interrupt. (m = 0 to 3, or 74)
* Arguments    : channel -
*                    Which channel to use
* Return Value : DMACA_SUCCESS -
*                    DMACmI interrupt is disabled successfully.
*                DMACA_ERR_INVALID_CH -
*                    Channel is invalid.
*******************************************************************************/
dmaca_return_t r_dmaca_int_disable(uint8_t channel)
{

    /* Clear the DMACmI interrupt Enable bit. */
    /* Clear the DMACmI priority level. */
    switch (channel)
    {
        case DMACA_CH0:
        {
            /* Clear the DMAC0I interrupt Enable bit. */
        	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC0I));

            /* Clear the DMAC0I priority level. */
            IPR(DMAC, DMAC0I) = 0;
            break;
        }
        case DMACA_CH1:
        {
            /* Clear the DMAC1I interrupt Enable bit. */
        	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC1I));

            /* Clear the DMAC1I priority level. */
            IPR(DMAC, DMAC1I) = 0;
            break;
        }
        case DMACA_CH2:
        {
            /* Clear the DMAC2I interrupt Enable bit. */
        	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC2I));

            /* Clear the DMAC2I priority level. */
            IPR(DMAC, DMAC2I) = 0;
            break;
        }
        case DMACA_CH3:
        {
            /* Clear the DMAC3I interrupt Enable bit. */
        	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC3I));

            /* Clear the DMAC3I priority level. */
            IPR(DMAC, DMAC3I) = 0;
            break;
        }
        case DMACA_CH4:
        {
            if (!((g_locking_sw[DMACA_CH5] || g_locking_sw[DMACA_CH6]) || g_locking_sw[DMACA_CH7]))
            {

                /* Clear the DMAC74I interrupt Enable bit. */
            	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC74I));

                /* Clear the DMAC74I priority level. */
                IPR(DMAC, DMAC74I) = 0;
            }
            break;
        }
        case DMACA_CH5:
        {
            if (!((g_locking_sw[DMACA_CH4] || g_locking_sw[DMACA_CH6]) || g_locking_sw[DMACA_CH7]))
            {

                /* Clear the DMAC74I interrupt Enable bit. */
            	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC74I));

                /* Clear the DMAC74I priority level. */
                IPR(DMAC, DMAC74I) = 0;
            }
            break;
        }
        case DMACA_CH6:
        {
            if (!((g_locking_sw[DMACA_CH4] || g_locking_sw[DMACA_CH5]) || g_locking_sw[DMACA_CH7]))
            {

                /* Clear the DMAC74I interrupt Enable bit. */
            	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC74I));

                /* Clear the DMAC74I priority level. */
                IPR(DMAC, DMAC74I) = 0;
            }
            break;
        }
        case DMACA_CH7:
        {
            if (!((g_locking_sw[DMACA_CH4] || g_locking_sw[DMACA_CH5]) || g_locking_sw[DMACA_CH6]))
            {

                /* Clear the DMAC74I interrupt Enable bit. */
            	R_BSP_InterruptRequestDisable(VECT(DMAC,DMAC74I));

                /* Clear the DMAC74I priority level. */
                IPR(DMAC, DMAC74I) = 0;
            }
            break;
        }
        default:
        {
            /* The channel number is invalid. */
            return DMACA_ERR_INVALID_CH;
            break;
        }
    }

    /* Check interrupt priority of DMAC0I*/
    if (0x00 == IPR(DMAC, DMAC0I))
    {
        /* do nothing */
    }

    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function r_dmaca_int_disable
*************************************************************************/

/*******************************************************************************
* Function Name: r_dmaca_int_enable
* Description  : Enables DMACmI interrupt. (m = 0 to 3, or 74)
* Arguments    : channel -
*                    Which channel to use
*              : priority -
*                    DMACmI interrupt priority level
* Return Value : DMACA_SUCCESS -
*                    DMACmI interrupt is enabled successfully.
*                DMACA_ERR_INVALID_CH -
*                    Channel is invalid.
*******************************************************************************/
dmaca_return_t r_dmaca_int_enable(uint8_t channel, uint8_t priority)
{
    /* Set the DMACmI priority level. */
    /* Set the DMACmI interrupt Enable bit. */
    switch (channel)
    {
        case DMACA_CH0:
        {

            /* Set the DMAC0I priority level. */
            IPR(DMAC, DMAC0I) = priority;

            /* Set the DMAC0I interrupt Enable bit. */
            R_BSP_InterruptRequestEnable(VECT(DMAC,DMAC0I));
            break;
        }
        case DMACA_CH1:
        {
            /* Set the DMAC1I priority level. */
            IPR(DMAC, DMAC1I) = priority;

            /* Set the DMAC1I interrupt Enable bit. */
            R_BSP_InterruptRequestEnable(VECT(DMAC,DMAC1I));
            break;
        }
        case DMACA_CH2:
        {

            /* Set the DMAC2I priority level. */
            IPR(DMAC, DMAC2I) = priority;

